package io.github.lazyimmortal.sesame.model.task.antForest;

import org.json.JSONArray;
import org.json.JSONObject;

import java.util.LinkedHashSet;
import java.util.Set;
import java.util.concurrent.atomic.AtomicInteger;

import io.github.lazyimmortal.sesame.hook.Toast;
import io.github.lazyimmortal.sesame.util.Log;
import io.github.lazyimmortal.sesame.util.MessageUtil;
import io.github.lazyimmortal.sesame.util.Statistics;
import io.github.lazyimmortal.sesame.util.Status;
import io.github.lazyimmortal.sesame.util.TimeUtil;
import io.github.lazyimmortal.sesame.util.idMap.ForestHuntIdMap;
import io.github.lazyimmortal.sesame.util.idMap.UserIdMap;

public class ForestChouChouLe {

  private static final String TAG = ForestChouChouLe.class.getSimpleName();

  void chouChouLe(
      Boolean ForestHuntDraw,
      Boolean ForestHuntHelp,
      Set<String> shareIds,
      Boolean ACTIVITYForestHuntHelp) {
    try {
      ForestHuntIdMap.load();
      // String source = "task_entry";
      // String source = "guide";
      // String source = "forestchouchoule";
      JSONObject resData =
          new JSONObject(
              AntForestRpcCall.enterDrawActivityopengreen(
                  "", "ANTFOREST_NORMAL_DRAW", "task_entry"));
      if (!MessageUtil.checkSuccess(TAG, resData)) {
        return;
      }
      // 提取drawSceneGroups数组
      JSONArray drawSceneGroups = resData.getJSONArray("drawSceneGroups");
      for (int i = 0; i < drawSceneGroups.length(); i++) {
        JSONObject drawScene = drawSceneGroups.getJSONObject(i);
        JSONObject drawActivity = drawScene.getJSONObject("drawActivity");

        String activityId = drawActivity.getString("activityId");
        String drawScenename = drawActivity.getString("name");
        String sceneCode = drawActivity.getString("sceneCode");

        chouChouLescene(
            ForestHuntDraw,
            activityId,
            drawScenename,
            sceneCode,
            ForestHuntHelp,
            shareIds,
            ACTIVITYForestHuntHelp);
      }
    } catch (Exception e) {
      Log.printStackTrace(e);
    }
  }

  void chouChouLescene(
      Boolean ForestHuntDraw,
      String activityId,
      String drawScenename,
      String sceneCode,
      Boolean ForestHuntHelp,
      Set<String> shareIds,
      Boolean ACTIVITYForestHuntHelp) {
    String taskUid = UserIdMap.getCurrentUid();
    try {
      boolean doublecheck;
      // ==================== 手动屏蔽任务集合 ====================
      Set<String> presetBad = new LinkedHashSet<>();
      presetBad.add("FOREST_NORMAL_DRAW_SHARE"); // 邀请好友任务（屏蔽）
      presetBad.add("FOREST_ACTIVITY_DRAW_SHARE");
      presetBad.add("FOREST_ACTIVITY_DRAW_SGBHSD");
      // 你可以在这里继续添加更多要屏蔽的任务

      // =====================================================

      int loopCount = 0; // 循环次数计数
      final int MAX_LOOP = 7; // 最大循环次数，避免死循环

      /*
      sceneCode
      ANTFOREST_NORMAL_DRAW_TASK
      ANTFOREST_ACTIVITY_DRAW_TASK

      taskType
      FOREST_NORMAL_DRAW_SHARE
      FOREST_ACTIVITY_DRAW_SHARE

      p2pSceneCode
      FOREST_NORMAL_20250829_SHARE
      FOREST_NORMAL_20251024_SHARE
       */
      do {
        doublecheck = false;
        JSONObject listTaskopengreen =
            new JSONObject(AntForestRpcCall.listTaskopengreen(sceneCode + "_TASK", "task_entry"));
        if (MessageUtil.checkSuccess(TAG, listTaskopengreen)) {
          JSONArray taskList = listTaskopengreen.getJSONArray("taskInfoList");
          for (int i = 0; i < taskList.length(); i++) {
            JSONObject taskInfo = taskList.getJSONObject(i);
            JSONObject taskBaseInfo = taskInfo.getJSONObject("taskBaseInfo");
            JSONObject bizInfo = new JSONObject(taskBaseInfo.getString("bizInfo"));
            String taskName = bizInfo.getString("title");
            String taskSceneCode = taskBaseInfo.getString("sceneCode");
            String taskStatus = taskBaseInfo.getString("taskStatus");
            String taskType = taskBaseInfo.getString("taskType");

            JSONObject taskRights = taskInfo.getJSONObject("taskRights");
            int rightsTimes = taskRights.getInt("rightsTimes");
            int rightsTimesLimit = taskRights.getInt("rightsTimesLimit");

            if (taskType.contains("_DRAW_SHARE") && ForestHuntHelp) {
              // if (!Status.hasFlagToday("Forest::" + sceneCode)) {
              int forestHuntHelpTodayCount = Status.getforestHuntHelpToday(taskType);
              if (forestHuntHelpTodayCount < shareIds.size()) {
                JSONObject prodPlayParam = new JSONObject(taskBaseInfo.getString("prodPlayParam"));
                String p2pSceneCode = prodPlayParam.getString("p2pSceneCode");
                Log.forest(
                    "森林寻宝🎰️执行["
                        + UserIdMap.getShowName(UserIdMap.getCurrentUid())
                        + "]助力好友["
                        + drawScenename
                        + "]");
                DoForestHuntHelp(shareIds, activityId, p2pSceneCode, taskType);
                // Status.flagToday("Forest::" + sceneCode,taskUid);
              }
            }
            // 在最后一个任务时强制开启活动场景助力
            if ((i == (taskList.length() - 1))
                && (!taskType.equals("FOREST_ACTIVITY_DRAW_SHARE"))) {
              if (ACTIVITYForestHuntHelp && sceneCode.equals("ANTFOREST_ACTIVITY_DRAW")) {
                int forestHuntHelpTodayCount =
                    Status.getforestHuntHelpToday("FOREST_ACTIVITY_DRAW_SHARE");
                if (forestHuntHelpTodayCount < shareIds.size()) {
                  // if (!Status.hasFlagToday("Forest::" + sceneCode)) {
                  Log.forest(
                      "森林寻宝🎰️执行["
                          + UserIdMap.getShowName(UserIdMap.getCurrentUid())
                          + "]助力好友[活动场景](薅羊毛，如果助力结果不返回成功请关闭配置项)");
                  DoForestHuntHelp(
                      shareIds,
                      activityId,
                      "FOREST_NORMAL_20251024_SHARE",
                      "FOREST_ACTIVITY_DRAW_SHARE");
                  // Status.flagToday("Forest::" + sceneCode,taskUid);
                }
              }
            }
            // ==================== 活力值兑换任务 =====================
            if (taskType.equals("NORMAL_DRAW_EXCHANGE_VITALITY") && taskStatus.equals("TODO")) {
              JSONObject sginRes =
                  new JSONObject(
                      AntForestRpcCall.exchangeTimesFromTaskopengreen(
                          activityId, sceneCode, "task_entry", taskSceneCode, taskType));
              if (MessageUtil.checkSuccess(TAG, sginRes)) {
                int times = sginRes.getInt("times");
                Log.forest("森林寻宝🏆[" + taskName + "]获得抽奖*" + times);
                doublecheck = true;
              }
              continue; // 防止进入下面的 FOREST_NORMAL_DRAW 分支
            }

            // 统一处理 FOREST_NORMAL_DRAW 和 FOREST_ACTIVITY_DRAW开头任务
            if ((taskType.startsWith("FOREST_NORMAL_DRAW")
                    || taskType.startsWith("FOREST_ACTIVITY_DRAW"))
                && taskStatus.equals("TODO")) {
              // ==================== 屏蔽逻辑 ====================
              if (presetBad.contains(taskType)) {
                Log.record("已屏蔽任务，跳过：" + taskName);
              } else {
                TimeUtil.sleep(1000);
                // 调用对应完成接口
                JSONObject result;
                if (taskType.contains("XLIGHT")) {
                  result =
                      new JSONObject(
                          AntForestRpcCall.finishTask4Chouchoule(taskType, taskSceneCode));
                } else {
                  result =
                      new JSONObject(AntForestRpcCall.finishTaskopengreen(taskType, taskSceneCode));
                }

                if (MessageUtil.checkSuccess(TAG, result)) {
                  Log.forest("森林寻宝🧾完成[" + taskName + "]");
                  doublecheck = true;
                }
              }
            }

            // 已完成任务领取奖励
            if (taskStatus.equals("FINISHED")) {
              TimeUtil.sleep(2000);
              JSONObject sginRes =
                  new JSONObject(
                      AntForestRpcCall.receiveTaskAwardopengreen(
                          "task_entry", taskSceneCode, taskType));
              if (MessageUtil.checkSuccess(TAG, sginRes)) {
                int incAwardCount = sginRes.getInt("incAwardCount");
                Log.forest("森林寻宝🏆[" + taskName + "]获得抽奖*" + incAwardCount);
                if (rightsTimesLimit - rightsTimes > 0) {
                  doublecheck = true;
                }
              }
            }
          }
        }
      } while (doublecheck && ++loopCount < MAX_LOOP);

      // ==================== 执行抽奖 ====================
      if (ForestHuntDraw) {
        JSONObject jo =
            new JSONObject(
                AntForestRpcCall.enterDrawActivityopengreen(activityId, sceneCode, "task_entry"));
        if (MessageUtil.checkSuccess(TAG, jo)) {
          JSONObject drawAsset = jo.getJSONObject("drawAsset");
          int blance = drawAsset.getInt("blance");

          while (blance > 0) {
            jo =
                new JSONObject(
                    AntForestRpcCall.drawopengreen(
                        activityId, sceneCode, "task_entry", UserIdMap.getCurrentUid()));
            if (MessageUtil.checkSuccess(TAG, jo)) {
              drawAsset = jo.getJSONObject("drawAsset");
              blance = drawAsset.getInt("blance");
              JSONObject prizeVO = jo.getJSONObject("prizeVO");
              String prizeName = prizeVO.getString("prizeName");
              int prizeNum = prizeVO.getInt("prizeNum");
              Log.forest(
                  "森林寻宝🎁领取["
                      + prizeName
                      + "*"
                      + prizeNum
                      + "]"
                      + "#["
                      + UserIdMap.getShowName(UserIdMap.getCurrentUid())
                      + "]");
              Toast.show("森林寻宝🎁领取[" + prizeName + "*" + prizeNum + "]");
              if (prizeName.contains("g能量")) {
                Statistics.addData(Statistics.DataType.COLLECTED, prizeNum);
              }
            }
          }
        }
      }

      // ==============================================

    } catch (Exception e) {
      Log.printStackTrace(e);
    }
  }

  // kuzVe2lrSrXFdacxxi3KWjxx-4O7FEYDgn0xx0OehP5jt9-YINZOkxgPDkvWvkwkQXSDbZ-77VUJcjlcZsjGio6MsAtmwxkxkx(FOREST_NORMAL_DRAW_SHARE)
  // kuzVe2lrSrXFdacxxi3KWjxx-4O7FEYDgn0xx0OehP5jt9-bxgpIW643h4FnWRjs9uZzng-77VUJcjlcZsjGio6MsAtmwxkxkx(FOREST_ACTIVITY_DRAW_SHARE)
  void DoForestHuntHelp(
      Set<String> shareIds, String activityId, String p2pSceneCode, String taskType) {
    String taskUid = UserIdMap.getCurrentUid();
    try {
      Integer forestHuntHelpTodayCount;

      for (String shareUserId : shareIds) {
        forestHuntHelpTodayCount = Status.getforestHuntHelpToday(taskType);
        // if (!Status.canForestHuntHelpToday(taskType + "::" + shareUserId)) {
        // 判断当天是否助力过
        if (Status.hasFlagToday(taskType + "::" + shareUserId)) {
          continue;
        }
        String shareId;
        if ((shareUserId.length() > 20 && shareUserId.length() < 27)
            && taskType.equals("FOREST_NORMAL_DRAW_SHARE")) {
          shareId =
              shareUserId
                  + "4O7FEYDgn0xx0OehP5jt9"
                  + "YINZOkxgPDkvWvkwkQXSDbZ"
                  + "77VUJcjlcZsjGio6MsAtmwxkxkx";
        } else if ((shareUserId.length() > 20 && shareUserId.length() < 27)
            && taskType.equals("FOREST_ACTIVITY_DRAW_SHARE")) {
          shareId =
              shareUserId
                  + "4O7FEYDgn0xx0OehP5jt9"
                  + "bxgpIW643h4FnWRjs9uZzng"
                  + "77VUJcjlcZsjGio6MsAtmwxkxkx";
        } else {
          Log.forest("森林寻宝🎰️存在错误usershareUserId:" + shareUserId);
          continue;
        }
        String userId = shareComponentRecall(p2pSceneCode, shareId);
        // Log.forest("森林寻宝🎰️尝试助力#" + ForestHuntIdMap.get(shareUserId));
        if (userId.equals("解析userID失败")) {
          continue;
        }
        TimeUtil.sleep(1500);
        String resconfirmShareRecall =
            confirmShareRecall(activityId, p2pSceneCode, shareId, userId);
        TimeUtil.sleep(1500);

        String userName =
            UserIdMap.getShowName(userId) != null ? UserIdMap.getShowName(userId) : userId;
        Log.forest("森林寻宝👊助力[" + userName + "]" + resconfirmShareRecall);
        // 标记助力成功
        Status.flagToday(taskType + "::" + shareUserId, taskUid);
        // Status.ForestHuntHelpToday(taskType + "::" + shareUserId, taskUid);
        forestHuntHelpTodayCount++;
        // 统计场景助力次数
        Status.forestHuntHelpToday(taskType, forestHuntHelpTodayCount, taskUid);
      }
    } catch (Throwable t) {
      Log.printStackTrace(TAG, t);
    }
  }

  private String shareComponentRecall(String sceneCode, String shareId) {
    try {
      JSONObject jo = new JSONObject(AntForestRpcCall.shareComponentRecall(sceneCode, shareId));
      if (!MessageUtil.checkSuccess(TAG, jo)) {
        return "解析shareID失败";
      }
      if (jo.has("inviterInfoVo")) {
        jo = jo.getJSONObject("inviterInfoVo");
        String userID = jo.getString("userId");
        return userID;
      }
    } catch (Throwable t) {
      Log.i(TAG, "shareComponentRecall err:");
      Log.printStackTrace(TAG, t);
    }
    return "解析userID失败";
  }

  private String confirmShareRecall(
      String activityId, String p2pSceneCode, String shareId, String userId) {
    try {
      JSONObject jo =
          new JSONObject(
              AntForestRpcCall.confirmShareRecall(activityId, p2pSceneCode, shareId, userId));
      return jo.getString("desc");
    } catch (Throwable t) {
      Log.i(TAG, "confirmShareRecall err:");
      Log.printStackTrace(TAG, t);
    }
    return "FALSE end";
  }
}


/*我的图标
1. Unicode Emojis 小图标 (可直接复制使用的)
  1.0.1 杂项符号和象形文字
  🌀🌁🌂🌃🌄🌅🌆🌇🌈🌉🌊🌋🌌🌍🌎🌏🌐🌑🌒🌓🌔🌕
          🌖🌗🌘🌙🌚🌛🌜🌝🌞🌟🌠🌡🌢🌣🌤🌥🌦🌧🌨🌩🌪🌫🌬
          🌭🌮🌯🌰🌱🌲🌳🌴🌵🌶🌷🌸🌹🌺🌻🌼🌽🌾🌿🍀🍁
          🍂🍃🍄🍅🍆🍇🍈🍉🍊🍋🍌🍍🍎🍏🍐🍑🍒🍓🍔🍕🍖
          🍗🍘🍙🍚🍛🍜🍝🍞🍟🍠🍡🍢🍣🍤🍥🍦🍧🍨🍩🍪🍫
          🍬🍭🍮🍯🍰🍱🍲🍳🍴🍵🍶🍷🍸🍹🍺🍻🍼🍽🍾🍿
          🎀🎁🎂🎃🎄🎅🎆🎇🎈🎉🎊🎋🎌🎍🎎🎏🎐🎑
          🎒🎓🎠🎡🎢🎣🎤🎥🎦🎧🎨🎩🎪🎫🎬🎭🎮🎯🎰🎱
          🎲🎳🎴🎵🎶🎷🎸🎹🎺🎻🎼🎽🎾🎿🏀🏁🏂🏃🏄🏅
          🏆🏇🏈🏉🏊🏋🏌🏍🏎🏏🏐🏑🏒🏓🏔🏕🏖🏗🏘🏙
          🏚🏛🏜🏝🏞🏟🏠🏡🏢🏣🏤🏥🏦🏧🏨🏩🏪🏫🏬🏭🏮
          🏯🏰🏱🏲🏳🏴🏵🏶🏷🏸🏹🏺🏻🏼🏽🏾🏿🐀🐁🐂🐃🐄🐅
          🐆🐇🐈🐉🐊🐋🐌🐍🐎🐏🐐🐑🐒🐓🐔🐕🐖🐗🐘🐙
          🐚🐛🐜🐝🐞🐟🐠🐡🐢🐣🐤🐥🐦🐧🐨🐩🐪🐫🐬🐭
          🐮🐯🐰🐱🐲🐳🐴🐵🐶🐷🐸🐹🐺🐻🐼🐽🐾🐿👀👁
          👂👃👄👅👆👇👈👉👊👋👌👍👎👏👐👑👒👓👔👕
          👖👗👘👙👚👛👜👝👞👟👠👡👢👣👤👥👦👧👨👩
          👪👫👬👭👮👯👰👱👲👳👴👵👶👷👸👹👺👻👼👽👾
          👿💀💁💂💃💄💅💆💇💈💉💊💋💌💍💎💏💐💑💒
          💓💔💕💖💗💘💙💚💛💜💝💞💟💠💡💢💣💤
          💥💦💧💨💩💪💫💬💭💮💯💰💱💲💳💴💵💶💷
          💸💹💺💻💼💽💾💿📀📁📂📃📄📅📆📇📈📉📊📋
          📌📍📎📏📐📑📒📓📔📕📖📗📘📙📚📛📜📝
          📞📟📠📡📢📣📤📥📦📧📨📩📪📫📬📭📮📯📰📱
          📲📳📴📵📶📷📸📹📺📻📼📽📾📿🔀🔁🔂🔃🔄🔅
          🔆🔇🔈🔉🔊🔋🔌🔍🔎🔏🔐🔑🔒🔓🔔🔕🔖
          🔗🔘🔙🔚🔛🔜🔝🔞🔟🔠🔡🔢🔣🔤🔥🔦🔧🔨🔩
          🔪🔫🔬🔭🔮🔯🔰🔱🔲🔳🔴🔵🔶🔷🔸🔹🔺🔻🔼🔽
          🕋🕌🕍🕎
          🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🕛🕜🕝🕞🕟🕠🕡🕢🕣🕤🕥🕦🕧
          🕴🕵🕶🕷🕸🕹🕺🖐🖕🖖🖤🖥🖨🖱🖲🖼🗂🗃🗑🗒🗓🗜🗝🗞🗡🗣🗨🗯🗳🗺🗻🗼🗽🗾🗿
          ✖💲‼☑️⚪️🏁💱
          1.0.2 几何图形拓展
  🞀🞁🞂🞃🞄🞅🞇🞉🞌🞍🞑🞒🞓🞔🞕🞖🞗🞘🞚🞛🞜🞝🞞🞠🞡🞢🞣🞤🞥🞦🞧🞨🞩🞪🞫🞬🞭🞮✔✅☑︎
          🞯🞰🞱🞲🞳🞴🞵🞶🞷🞸🞹🞺🞻🞼🞽🞾🞿🟀🟂🟃🟄🟆🟇🟈🟉🟊🟌🟍🟎🟐🟒🟔🟘
          🟠🟡🟢🟣🟤🟥🟦🟧🟨🟩🟪🟫
          1.0.3 扑克牌
  🂠🂡🂢🂣🂤🂥🂦🂧🂨🂩🂪🂫🂬🂭🂮🂱🂲🂳🂴🂵🂶🂷🂸🂹🂺🂻🂼🂽🂾🂿
          🃁🃂🃃🃄🃅🃆🃇🃈🃉🃊🃋🃌🃍🃎🃏🃑🃒🃓🃔🃕🃖🃗🃘🃙🃚🃛🃜🃝🃞🃟
          🃠🃡🃢🃣🃤🃥🃦🃧🃨🃩🃪🃫🃬🃭🃮🃯🃰🃱🃲🃳🃴🃵
          1.0.4 麻将牌
  🀀🀁🀂🀃🀄🀅🀆🀇🀈🀉🀊🀋🀌🀍🀎🀏🀐🀑🀒🀓🀔🀕🀖🀗🀘
          🀙🀚🀛🀜🀝🀞🀟🀠🀡🀢🀣🀤🀥🀦🀧🀨🀩🀪🀫
          1.0.5 多米诺骨牌
  🀰🀱🀲🀳🀴🀵🀶🀷🀸🀹🀺🀻🀼🀽🀾🀿🁀🁁🁂🁃🁄🁅🁆🁇🁈🁉🁊
          🁋🁌🁍🁎🁏🁐🁑🁒🁓🁔🁕🁖🁗🁘🁙🁚🁛🁜🁝🁞🁟🁠🁡
          🁢🁣🁤🁥🁦🁧🁨🁩🁪🁫🁬🁭🁮🁯🁰🁱🁲🁳🁴🁵🁶🁷🁸🁹🁺
          🁻🁼🁽🁾🁿🂀🂁🂂🂃🂄🂅🂆🂇🂈🂉🂊🂋🂌🂍🂎🂏🂐🂑🂒🂓
          1. 1 表情
  🤗🤫🤣🙃🙂🥰🤩🤪🤑🤭🤔
          🤐🤬🥱😩🥺🧐🤓😎🤠🥳😵‍💫
          🤯🤧😷🤒🤕🤢🤮🥵🥶🥴🤤
          🤥🤨🤖🤡💩
  非礼勿视 🙈
  非礼勿听 🙉
  非礼勿言 🙊
          😀😁😂😃😄😅😆😉😊😋😎😍😘😗😙😚☺😇😐😑😶😏😣
          😥😮😯😪😫😴😌😛😜😝😒😓😔😕😲😷😖😞😟😤😢😭😦
          😧😨😬😰😱😳😵😡😠
          1.1.1 情感
  💋💯💢💥💫💦💨🕳💬👁️‍🗨️🗨🗯💭💤
          1. 2 人物
  👦👧👨👩👴👵👶👱👮👲👳👷👸💂🎅👰👼💆💇🙍🙎🙅🙆💁🙋🙇
          🙌🙏👤👥🚶🏃👯💃👫👬👭💏💑👪
          1.2.1 肤色+发型+性别
  👴👴🏻👴🏼👴🏽👴🏾👴🏿
          💇🦰🦱🦳🦲
          🧑👨👩👫
          1.3 手势
  💪👈👉☝👆👇✌✋👌👍👎✊👊👋👏👐✍
          1.4 日常
  👣👀👂👃👅👄💋👓👔👕👖👗👘👙👚👛👜👝🎒💼👞👟👠👡👢👑
          👒🎩🎓💄💅💍🌂
          1.5 手机
  📱📲📶📳📴☎📞📟📠
          1.5.1 视频标志
  🐊😭⏏️⏏️🔀🔁🔂▶⏩⏭⏯◀⏪⏮
          🔼⏫🔽⏬⏸⏹⏺⏏🎦🔅🔆📶📳📴
          1.6 公共/社会
  ♻🏧🚮🚰♿🚹🚺🚻🚼🚾⚠🚸⛔🚫🚳🚭🚯🚱🚷🔞💈
          1.7 动物
  🙈🙉🙊🐵🐒🐶🐕🐩🐺🐱😺😸😹😻😼😽🙀😿😾🐈
          🐯🐅🐆🐴🐎🐮🐂🐃🐄🐷🐖🐗🐽🐏🐑🐐🐪🐫🐘
          🐭🐁🐀🐹🐰🐇🐻🐨🐼🐾🐔🐓🐣🐤🐥🐦🐧🐸
          🐊🐢🐍🐲🐉🐳🐋🐬🐟🐠🐡🐙🐚🐌🐛🐜🐝🐞🦋

          1.8 植物
  💐🌸💮🌹🌺🌻🌼🌷🌱🌲🌳🌴🌵🌾🌿🍀🍁🍂🍃
          1.9 自然
  🌍🌎🌏🌐🌑🌒🌓🌔🌕🌖🌗🌘🌙🌚🌛🌜
          ☀🌝🌞⭐🌟🌠☁⛅☔⚡❄🔥💧🌊
          1.10 饮食
  🍇🍈🍉🍊🍋🍌🍍🍎🍏🍐🍑🍒🍓🍅🍆🌽🍄🌰🍞
          🍖🍗🍔🍟🍕🍳🍲🍱🍘🍙🍚🍛🍜🍝🍠🍢🍣🍤🍥🍡
          🍦🍧🍨🍩🍪🎂🍰🍫🍬🍭🍮🍯🍼☕🍵🍶🍷🍸🍹🍺🍻🍴
          1.11 文体
  🎪🎭🎨🎰🚣🛀🎫🏆⚽⚾🏀🏈🏉🎾🎱🎳⛳🎣🎽🎿
          🏂🏄🏇🏊🚴🚵🎯🎮🎲🎷🎸🎺🎻🎬
          1.12 恐怖
  😈👿👹👺💀☠👻👽👾💣
          1.13 旅游
  🌋🗻🏠🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒🗼🗽⛪⛲
          🌁🌃🌆🌇🌉🌌🎠🎡🎢🚂🚃🚄🚅🚆🚇🚈🚉🚊🚝🚞🚋🚌
          🚍🚎🚏🚐🚑🚒🚓🚔🚕🚖🚗🚘🚚🚛🚜🚲⛽🚨🚥🚦🚧⚓⛵
          🚤🚢✈💺🚁🚟🚠🚡🚀🎑🗿🛂🛃🛄🛅
          1.14 物品
  💌💎🔪💈🚪🚽🚿🛁⌛⏳⌚⏰🎈🎉🎊🎎🎏🎐🎀🎁📯📻📱📲
          ☎📞📟📠🔋🔌💻💽💾💿📀🎥📺📷📹📼🔍🔎🔬🔭📡💡🔦
          🏮📔📕📖📗📘📙📚📓📃📜📄📰📑🔖💰💴💵💶💷💸💳✉📧
          📨📩📤📥📦📫📪📬📭📮✏✒📝📁📂📅📆📇📈📉📊📋📌
          📍📎📏📐✂🔒🔓🔏🔐🔑🔨🔫🔧🔩🔗💉💊🚬🔮🚩🎌💦💨
          1.15 标识/标志
  ♠♥♦♣🀄🎴🔇🔈🔉🔊📢📣💤💢💬💭♨🌀🔔🔕✡✝🔯📛🔰🔱⭕
          ✅☑✔✖❌❎➕➖➗➰➿〽✳✴❇‼⁉❓❔❕❗©®™🎦🔅🔆💯🔠🔡🔢🔣🔤🅰🆎🅱🆑🆒🆓ℹ🆔Ⓜ🆕🆖🅾🆗🅿
          🆘🆙🆚🈁🈂🈷🈶🈯🉐🈹🈚🈲🉑🈸🈴🈳㊗㊙🈺🈵▪▫◻◼◽◾⬛⬜🔶🔷🔸🔹🔺🔻💠🔲🔳⚪⚫🔴🔵
          1.16 生肖
  🐁🐂🐅🐇🐉🐍🐎🐐🐒🐓🐕🐖
          1.17 星座
  ♈♉♊♋♌♍♎♏♐♑♒♓⛎
          1.18 时间/时钟/钟表
  🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕡🕖🕢🕗🕣🕘🕤🕙🕥🕚🕦
          ⌛⏳⌚⏰⏱⏲🕰
          1.19 爱心/心形/爱情
  ❤💌💝❤️‍🔥❤️‍🩹
          🧡💛💚💙💜🤎🖤🤍
          💘❤💓💔💕💖💗💙💚💛💜💝💞💟❣
          1.20 花草/植物
  💐🌸💮🌹🌺🌻🌼🌷🌱🌿🍀 🌿🍀🍁🍂🍃
          1.21 月亮
  🌑🌒🌓🌔🌕🌖🌗🌘🌙🌚🌛🌜🌝
          1.22 水果
  🍇🍈🍉🍊🍋🍌🍍🍎🍏🍐🍑🍒🍓
          1.23 钱包
  💴💵💶💷💰💸💳
          1.24 交通
  🚂🚃🚄🚅🚆🚇🚈🚉🚊🚝🚞🚋🚌🚍🚎🚏🚐🚑🚒🚓🚔🚕
          🚖🚗🚘🚚🚛🚜🚲⛽🚨🚥🚦🚧⚓⛵🚣🚤🚢✈💺🚁🚟🚠🚡🚀
          1.25 建筑
  🏠🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒🗼🗽⛪🌆🌇🌉
          1.26 办公
  📱📲☎📞📟📠🔋🔌💻💽💾💿📀🎥📺📷📹📼🔍🔎🔬🔭📡📔📕
          📖📗📘📙📚📓📃📜📄📰📑🔖💳✉📧📨📩📤📥📦📫📪📬📭📮
          ✏✒📝📁📂📅📆📇📈📉📊📋📌📍📎📏📐✂🔒🔓🔏🔐🔑
          1.27 箭头/方向
  ⬆↗➡↘⬇↙⬅↖↕↔↩↪⤴⤵🔃🔄🔙🔚🔛🔜🔝
          2. Unicode 非 Emojis (可直接复制使用的)
  2.0 装饰符号
  ✀✁✂✃✄✅✆✇✈✉✊✋✌✍✎✏✐✑✒✓✔✕✖✗✘
          ✙✚✛✜✝✞✟✠✡✢✣✤✥✦✧✨✩✪✫✬✭✮✯✰
          ✱✲✳✴✵✶✷✸✹✺✻✼✽✾✿❀❁❂❃❄❅❆❇❈❉❊❋
          ❌❍❎❏❐❑❒❓❔❕❖❗❘❙❚❛❜❝❞❟❠❡❢❣❤❥❦❧❨❩❪❫❬❭❮❯❰❱❲❳❴❵❶❷❸❹❺❻❼❽❾❿➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓➔
          ➕➖➗➘➙➚➛➜➝➞➟➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➯
          ➰➱➲➳➴➵➶➷➸➹➺➻➼➽➾➿
          2.1 特殊符号
  ♠♣♧♡♥❤❥❣♂♀✲☀☼☾☽◐◑☺☻☎☏✿❀№↑↓←→
          √×÷★℃℉°◆◇⊙■□△▽¿½☯✡㍿卍卐♂♀✚〓㎡♪♫♩♬
          ㊚㊛囍㊒㊖Φ♀♂‖$@*&#※卍卐Ψ♫♬♭♩♪♯♮⌒¶∮‖€￡¥$
  2.2 编号序号
  ①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳⓪
          ❶❷❸❹❺❻❼❽❾❿⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴
          ㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩
          ⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄⒅⒆⒇
          ⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛
  ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹ
  ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ
          ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ
          ⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵
          2.3 数学符号
  ﹢﹣×÷±/=≌∽≦≧≒﹤﹥≈≡≠=≤≥<>≮≯∷∶∫∮∝∞∧∨∑∏∪∩∈∵∴
          ⊥∥∠⌒⊙√∟⊿㏒㏑%‰
          ⅟½⅓⅕⅙⅛⅔⅖⅚⅜¾⅗⅝⅞⅘
          ≂≃≄≅≆≇≈≉≊≋≌≍≎≏
          ≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩⊰⊱
          ⋛⋚∫∬∭∮∯∰∱∲∳%℅‰‱øØπ

  2.4 爱心符号

  ♥❣ღ♠♡♤❤❥

          2.5 标点符号

  。，、＇：∶；?‘’“”〝〞ˆˇ﹕︰﹔﹖﹑•¨….¸;！´？！
          ～—ˉ｜‖＂〃｀@﹫¡¿﹏﹋﹌︴々﹟#﹩$﹠&﹪%
          *﹡﹢﹦﹤‐￣¯―﹨ˆ˜﹍﹎+=<＿ *-\ˇ~﹉﹊（）〈〉
          ‹›﹛﹜『』〖〗［］《》〔〕{}「」【】︵︷︿︹︽*
          ﹁﹃︻︶︸﹀︺︾ˉ﹂﹄︼❝❞

          2.6 单位符号

  °′″＄￥〒￠￡％＠℃℉﹩﹪‰﹫
          ㎡㏕㎜㎝㎞㏎m³㎎㎏㏄º○¤%$º¹²³

          2.7 货币符号

          €£Ұ₴$₰¢₤¥₳₲₪₵元₣₱฿¤₡₮₭₩
  ރ円₢₥₫₦zł﷼₠₧₯₨Kčर₹ƒ₸￠

  2.8 箭头符号

  ↑↓←→↖↗↘↙↔↕➻➼➽➸➳➺➻➴➵➶➷➹▶►▷◁◀◄
          «»➩➪➫➬➭➮➯➱⏎➲➾➔➘➙➚➛➜➝➞➟➠➡➢➣
          ➤➥➦➧➨↚↛↜↝↞↟↠↠↡↢↣↤↤↥↦↧↨
          ⇄⇅⇆⇇⇈⇉⇊⇋⇌⇍⇎⇏⇐⇑⇒⇓⇔⇖⇗⇘⇙⇜↩↪↫↬↭↮
          ↯↰↱↲↳↴↵↶↷↸↹☇☈↼↽↾↿⇀⇁⇂⇃⇞⇟⇠⇡⇢⇣⇤⇥⇦⇧⇨⇩⇪↺↻⇚⇛♐

          2.9 符号图案

  ✐✎✏✑✒✍✉✁✂✃✄✆✉☎☏☑✓✔√☐☒✗✘ㄨ✕✖✖
          ☢☠☣✈★☆✡囍㍿☯☰☲☱☴☵☶☳☷☜☞☝✍☚☛☟✌
          ♤♧♡♢♠♣♥♦☀☁☂❄☃♨웃유❖☽☾☪✿♂♀✪✯☭➳卍卐√×■◆●○
          ◐◑✙☺☻❀⚘♔♕♖♗♘♙♚♛♜♝♞♟♧♡♂♀♠♣♥❤☜☞☎☏⊙◎☺☻☼
          ▧▨♨◐◑↔↕▪▒◊◦▣▤▥▦▩◘◈◇♬♪♩♭♪の★☆→あぃ￡Ю〓§♤♥▶¤✲❈
          ✿✲❈➹☀☂☁【】┱┲❣✚✪✣✤✥✦❉❥❦❧❃❂❁❀✄☪☣☢☠☭ღ
  ▶▷◀◁☀☁☂☃☄★☆☇☈⊙☊☋☌☍ⓛⓞⓥⓔ╬『』∴☀♫♬♩♭♪☆∷﹌の
  ★◎▶☺☻►◄▧▨♨◐◑↔↕↘▀▄█▌
          ◦☼♪の☆→♧ぃ￡❤▒▬♦◊◦♠♣▣
          ۰•❤•۰►◄▧▨♨◐◑↔↕▪▫☼♦⊙●○①⊕◎Θ⊙¤㊣★☆♀◆◇◣◢◥▲▼△▽⊿
          ◤◥✐✌✍✡✓✔✕✖♂♀♥♡☜☞☎☏⊙◎☺☻►◄▧▨♨◐◑↔↕♥♡▪▫☼♦▀▄█▌
          ▐░▒▬♦◊◘◙◦☼♠♣▣▤▥▦▩◘◙◈♫♬♪♩♭♪✄☪
          ☣☢☠♯♩♪♫♬♭♮☎☏☪♈ºº₪¤큐«»™♂✿♥ ◕‿-｡ ｡◕‿◕｡

          2.10 希腊字母

          ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨ
  Ωαβγδεζνξοπρσηθικλμτυφχψω

  2.11 俄语字母

          АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩ
  ЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя

  2.12 汉语拼音

  āáǎàōóǒòēéěèīíǐìūúǔùǖǘǚǜüêɑńňɡ
          ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗㄘㄙ
  ㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦㄧㄨㄩ

  2.13 中文字符

          零壹贰叁肆伍陆柒捌玖拾佰仟万亿吉太拍艾分厘毫微
  卍卐卄巜弍弎弐朤氺曱甴囍兀々〆のぁ〡〢〣〤〥〦〧〨〩
  ㊎㊍㊌㊋㊏㊚㊛㊐㊊㊣㊤㊥㊦㊧㊨㊒㊫㊑㊓㊔㊕㊖
          ㊗㊘㊜㊝㊞㊟㊠㊡㊢㊩㊪㊬㊭㊮㊯㊰
          ㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉

          2.14 日文平假名片假名

          ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただ
  ちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめも
          ゃやゅゆょよらりるれろゎわゐゑをんゔゕゖァアィイゥウェエォオカガキギ
  クグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパ
          ヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
  ヵヶヷヸヹヺ・ーヽヾヿ゠ㇰㇱㇲㇳㇴㇵㇶㇷㇸㇹㇺㇻㇼㇽㇾㇿ

  2.15 制表符

  ─ ━│┃╌╍╎╏┄ ┅┆┇┈ ┉┊┋┌┍┎┏┐┑┒┓└ ┕┖┗ ┘┙┚┛├┝┞┟┠┡┢┣ ┤┥┦
          ┧┨┩┪┫┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊
          ╋ ╪ ╫ ╬═║╒╓╔ ╕╖╗╘╙╚ ╛╜╝╞╟╠ ╡╢╣╤ ╥ ╦ ╧ ╨ ╩ ╳╔ ╗╝╚ ╬ ═
          ╓ ╩ ┠ ┨┯ ┷┏ ┓┗ ┛┳ ⊥ ﹃ ﹄┌ ╮ ╭ ╯╰

          2.16 皇冠符号

  ♚ ♛ ♝ ♞ ♜ ♟ ♔ ♕ ♗ ♘ ♖ ♟

          2.17 一些特殊字符

  ♥ ღ ❣ **❁** ❀ ✿҉ ❥ ♤ ♠ ♣ ✿ এ ✿ ♡ ༺๑๑༻  ✨ ⚡☔ ⛄
          ? დ ✿ ♔ ♕ ♚ ♛ ✫ ❤ ☯ ❧ ?ஐ ﻬ ღ ❆ ❁ ☇ ☈ ₪₪  ส็็็็็็ ਊ ﻬﻬ શ
   ♚♛♔♕ ೯ ೮ ೭ ೬ ೫ ೪ ೩ ೨ ೧ ೦
  ೡ ೠ ೞ ೖ ೕ ್ ೌ ೋ ೊ ೈ ೇ ೆ ೄ
          ೃ ೂ ು ೀ ಿ ಾ ಹ ಸ ಷ ಶ ವ ಳ ಲ ಱ ರ ಯಮ
  ಭ ಬ ಫ ಪ ನ ಧ ದ ಥ ತ ಣ ಢ ಡ ಠ
  ಟ ಞ ಝ ಜ ಛ ಚ ಙ ಘ ಗ ಖ ಕ ಔ ಓ ಒ ಐ ಏ ಎ
  ಌ ಋ ಊ ಉ ಈ ಇ ಆ ಅಃ ಂ ͜❀҉ এ ృ
  ʚΐɞ ʚɞ ﻬ ๑ ๓͜✿҉ ͜梁ღ҉ ℘ ೄ ζั͡ ต ԅ️ ✾ ೄ೨❀҉ এ
   ృ ʚΐɞ ʚɞ ﻬ ๑ ๓͜✿҉ ͜ღ҉ ℘ ೄ ζั͡ ต ԅ️ ✾
          ೄϿ҉ ✿ ೃ ✿҉͜ ✿ ζั͡✿ ℳღ

  2.18 其它符号和箭头

  ⬀⬁⬂⬃⬄⬅⬆⬇⬈⬉⬊⬋⬌⬍⬎⬏⬐⬑⬒⬓⬔⬕⬖⬗⬘⬙⬚⬛⬜
          ⬝⬞⬟⬠⬡⬢⬣⬤⬥⬦⬧⬨⬩⬪⬫⬬⬭⬮⬯⬰⬱⬲⬳⬴⬵⬶⬷⬸
          ⬹⬺⬻⬼⬽⬾⬿⭀⭁⭂⭃⭄⭅⭆⭇⭈⭉⭊⭋⭌⭍⭎⭏⭐⭑⭒⭓⭔
          ⭕⭖⭗⭘⭙⭚⭛⭜⭝⭞⭟⭠⭡⭢⭣⭤⭥⭦⭧⭨⭩⭪⭫⭬⭭⭮⭯⭰⭱⭲⭳⭶⭷
          ⭸⭹⭺⭻⭼⭽⭾⭿⮀⮁⮂⮃⮄⮅⮆⮇⮈⮉⮊⮋⮌⮍⮎⮏⮐⮑⮒⮓⮔
          ⮕⮘⮙⮚⮛⮜⮝⮞⮟⮠⮡⮢⮣⮤⮥⮦⮧⮨⮩⮪⮫⮬⮭⮮⮯⮰⮱⮲⮳⮴⮵⮶⮷
          ⮸⮹⮺⮻⮼⮽⮾⮿⯀⯁⯂⯃⯄⯅⯆⯇⯈⯉⯊⯋⯌⯍⯎⯏⯐⯬⯭⯮⯯

          2.19 数学运算符

  ∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎∏∐∑−∓∔∕∖∗∘∙√∛∜∝∞∟∠∡∢∣∤∥∦∧∨
          ∩∪∫∬∭∮∯∰∱∲∳∴∵∶∷∸∹∺∻∼∽∾∿≀≁≂≃≄≅≆≇
          ≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟≠≡≢≣≤≥≦≧≨≩
          ≪≫≬≭≮≯≰≱≲≳≴≵≶≷≸≹≺≻≼≽≾≿⊀⊁⊂⊃⊄⊅⊆⊇⊈⊉⊊⊋
          ⊌⊍⊎⊏⊐⊑⊒⊓⊔⊕⊖⊗⊘⊙⊚⊛⊜⊝⊞⊟⊠⊡⊢⊣⊤⊥⊦⊧⊨⊩
          ⊪⊫⊬⊭⊮⊯⊰⊱⊲⊳⊴⊵⊶⊷⊸⊹⊺⊻⊼⊽⊾⊿⋀⋁⋂⋃⋄⋅⋆⋇⋈⋉⋊⋋⋌
          ⋍⋎⋏⋐⋑⋒⋓⋔⋕⋖⋗⋘⋙⋚⋛⋜⋝⋞⋟⋠⋡⋢⋣⋤⋥⋦⋧⋨⋩⋪⋫⋬⋭
          ⋮⋯⋰⋱⋲⋳⋴⋵⋶⋷⋸⋹⋺⋻⋼⋽⋾⋿

          2.20 带圈字母数字补充

  🄀🄁🄂🄃🄄🄅🄆🄇🄈🄉🄊🄋🄌
          🄐🄑🄒🄓🄔🄕🄖🄗🄘🄙🄚🄛🄜🄝🄞🄟🄠🄡🄢🄣🄤🄥🄦🄧🄨🄩
          🄪🄫🄬🄭🄮🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉🅊🅋🅌🅍🅎🅏
          🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩
          🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉
          🆊🆋🆌🆍🆎🆏🆐🆑🆒🆓🆔🆕🆖🆗🆘🆙🆚
          🇦🇧🇨🇩🇪🇫🇬🇭🇮🇯🇰🇱🇲🇳🇴🇵🇶🇷🇸🇹🇺🇻🇼🇽🇾🇿

          2.21 一般标点符号
    ​‌‍‎‏‐‑‒–—―‖‗‘’‚‛“”„‟†‡•‣․‥…‧  ‪‫‬‭‮ ‰‱′″‴‵‶‷‸‹›※‼‽
            ‾‿⁀⁁⁂⁃⁄⁅⁆⁇⁈⁉⁊⁋⁌⁍⁎⁏⁐⁑
          ⁒⁓⁔⁕⁖⁗⁘⁙⁚⁛⁜⁝⁞ ⁠⁡⁢⁣⁤⁦⁧⁨⁩⁪⁫⁬⁭⁮⁯
          2.22 方框绘制字符
  ─━│┃┄┅┆┇┈┉┊┋┌┍┎┏┐┑┒┓└┕┖┗┘┙┚┛├┝┞┟┠┡┢┣┤┥┦┧┨┩┪┫
          ┬┭┮┯┰┱┲┳┴┵┶┷┸┹┺┻┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋╌╍╎╏═║╒╓╔╕╖╗
          ╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬╭╮╯╰╱╲╳╴╵╶╷╸╹╺╻╼╽╾╿
          2.23 上标和下标
  ⁰ⁱ⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ ₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎ₐₑₒₓₔₕₖₗₘₙₚₛₜ
  2.24 八思巴字
          ꡀꡁꡂꡃꡄꡅꡆꡇꡈꡉꡊꡋꡌꡍꡎꡏꡐꡑꡒꡓꡔꡕ
  ꡖꡗꡘꡙꡚꡛꡜꡝꡞꡟꡠꡡꡢꡣꡤꡥꡦꡧꡨꡩꡪꡫꡬꡭꡮꡯꡰꡱꡲꡳ꡴꡵꡶꡷
          2.25 埃及圣书体
          𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏𓀐𓀑𓀒𓀓𓀔𓀕𓀖𓀗𓀘𓀙𓀚𓀛𓀜𓀝𓀞𓀟𓀠𓀡𓀢𓀣𓀤𓀥𓀦𓀧𓀨𓀩𓀪𓀫𓀬
  𓀭𓀮𓀯𓀰𓀱𓀲𓀳𓀴𓀵𓀶𓀷𓀸𓀹𓀺𓀻𓀼𓀽𓀾𓀿𓁀𓁁𓁂𓁃𓁄𓁅𓁆𓁇𓁈𓁉𓁊𓁋𓁌𓁍𓁎𓁏𓁐𓁑𓁒𓁓𓁔𓁕𓁖𓁗𓁘𓁙𓁚𓁛𓁜𓁝𓁞
          𓁟𓁠𓁡𓁢𓁣𓁤𓁥𓁦𓁧𓁨𓁩𓁪𓁫𓁬𓁭𓁮𓁯𓁰𓁱𓁲𓁳𓁴𓁵𓁶𓁷𓁸𓁹𓁺𓁻𓁼𓁽𓁾𓁿𓂀𓂁𓂂𓂃𓂄𓂅𓂆𓂇𓂈𓂉𓂊𓂋𓂌𓂍𓂎𓂏
  𓂐𓂑𓂒𓂓𓂔𓂕𓂖𓂗𓂘𓂙𓂚𓂛𓂜𓂝𓂞𓂟𓂠𓂡𓂢𓂣𓂤𓂥𓂦𓂧𓂨𓂩𓂪𓂫𓂬𓂭𓂮𓂯𓂰𓂱𓂲𓂳𓂴𓂵𓂶𓂷𓂸𓂹
          𓂺𓂻𓂼𓂽𓂾𓂿𓃀𓃁𓃂𓃃𓃄𓃅𓃆𓃇𓃈𓃉𓃊𓃋𓃌𓃍𓃎𓃏𓃐𓃑𓃒𓃓𓃔𓃕𓃖𓃗𓃘𓃙𓃚𓃛𓃜𓃝𓃞𓃟𓃠𓃡𓃢𓃣𓃤
  𓃥𓃦𓃧𓃨𓃩𓃪𓃫𓃬𓃭𓃮𓃯𓃰𓃱𓃲𓃳𓃴𓃵𓃶𓃷𓃸𓃹𓃺𓃻𓃼𓃽𓃾𓃿𓄀𓄁𓄂𓄃𓄄𓄅𓄆𓄇𓄈𓄉𓄊𓄋𓄌𓄍𓄎𓄏
          𓄐𓄑𓄒𓄓𓄔𓄕𓄖𓄗𓄘𓄙𓄚𓄛𓄜𓄝𓄞𓄟𓄠𓄡𓄢𓄣𓄤𓄥𓄦𓄧𓄨𓄩𓄪𓄫𓄬𓄭𓄮𓄯𓄰𓄱𓄲𓄳𓄴𓄵𓄶𓄷𓄸𓄹𓄺𓄻𓄼𓄽𓄾𓄿
  𓅀𓅁𓅂𓅃𓅄𓅅𓅆𓅇𓅈𓅉𓅊𓅋𓅌𓅍𓅎𓅏𓅐𓅑𓅒𓅓𓅔𓅕𓅖𓅗𓅘𓅙𓅚𓅛𓅜𓅝𓅞𓅟𓅠𓅡𓅢𓅣𓅤
          𓅥𓅦𓅧𓅨𓅩𓅪𓅫𓅬𓅭𓅮𓅯𓅰𓅱𓅲𓅳𓅴𓅵𓅶𓅷𓅸𓅹𓅺𓅻𓅼𓅽𓅾𓅿𓆀𓆁𓆂𓆃𓆄𓆅𓆆𓆇𓆈𓆉𓆊𓆋𓆌𓆍𓆎
  𓆏𓆐𓆑𓆒𓆓𓆔𓆕𓆖𓆗𓆘𓆙𓆚𓆛𓆜𓆝𓆞𓆟𓆠𓆡𓆢𓆣𓆤𓆥𓆦𓆧𓆨𓆩𓆪𓆫𓆬𓆭𓆮𓆯𓆰𓆱𓆲𓆳𓆴𓆵𓆶𓆷𓆸𓆹𓆺
          𓆻𓆼𓆽𓆾𓆿𓇀𓇁𓇂𓇃𓇄𓇅𓇆𓇇𓇈𓇉𓇊𓇋𓇌𓇍𓇎𓇏𓇐𓇑𓇒𓇓𓇔𓇕𓇖𓇗𓇘𓇙𓇚𓇛𓇜𓇝𓇞𓇟𓇠𓇡𓇢𓇣𓇤𓇥𓇦𓇧𓇨𓇩𓇪𓇫𓇬𓇭𓇮𓇯𓇰𓇱
  𓇲𓇳𓇴𓇵𓇶𓇷𓇸𓇹𓇺𓇻𓇼𓇽𓇾𓇿𓈀𓈁𓈂𓈃𓈄𓈅𓈆𓈇𓈈𓈉𓈊𓈋𓈌𓈍𓈎𓈏𓈐𓈑𓈒𓈓𓈔𓈕𓈖𓈗𓈘𓈙𓈚𓈛𓈜𓈝𓈞
          𓈟𓈠𓈡𓈢𓈣𓈤𓈥𓈦𓈧𓈨𓈩𓈪𓈫𓈬𓈭𓈮𓈯𓈰𓈱𓈲𓈳𓈴𓈵𓈶𓈷𓈸𓈹𓈺𓈻𓈼𓈽𓈾𓈿𓉀𓉁𓉂𓉃𓉄𓉅𓉆𓉇𓉈𓉉𓉊𓉋𓉌𓉍𓉎𓉏𓉐
  𓉑𓉒𓉓𓉔𓉕𓉖𓉗𓉘𓉙𓉚𓉛𓉜𓉝𓉞𓉟𓉠𓉡𓉢𓉣𓉤𓉥𓉦𓉧𓉨𓉩𓉪𓉫𓉬𓉭𓉮𓉯𓉰𓉱𓉲𓉳𓉴𓉵𓉶𓉷𓉸𓉹𓉺𓉻𓉼𓉽𓉾𓉿𓊀𓊁𓊂𓊃𓊄𓊅𓊆𓊇𓊈𓊉
          𓊊𓊋𓊌𓊍𓊎𓊏𓊐𓊑𓊒𓊓𓊔𓊕𓊖𓊗𓊘𓊙𓊚𓊛𓊜𓊝𓊞𓊟𓊠𓊡𓊢𓊣𓊤𓊥𓊦𓊧𓊨𓊩𓊪𓊫𓊬𓊭𓊮𓊯𓊰𓊱𓊲𓊳𓊴𓊵𓊶𓊷𓊸
  𓊹𓊺𓊻𓊼𓊽𓊾𓊿𓋀𓋁𓋂𓋃𓋄𓋅𓋆𓋇𓋈𓋉𓋊𓋋𓋌𓋍𓋎𓋏𓋐𓋑𓋒𓋓𓋔𓋕𓋖𓋗𓋘𓋙𓋚𓋛𓋜𓋝𓋞𓋟𓋠𓋡𓋢𓋣𓋤𓋥𓋦𓋧𓋨𓋩𓋪𓋫
          𓋬𓋭𓋮𓋯𓋰𓋱𓋲𓋳𓋴𓋵
  𓋶𓋷𓋸𓋹𓋺𓋻𓋼𓋽𓋾𓋿𓌀𓌁𓌂𓌃𓌄𓌅𓌆𓌇𓌈𓌉𓌊𓌋𓌌𓌍𓌎𓌏𓌐𓌑𓌒𓌓𓌔𓌕𓌖𓌗𓌘𓌙𓌚𓌛𓌜𓌝𓌞𓌟𓌠𓌡𓌢𓌣𓌤𓌥𓌦𓌧𓌨𓌩𓌪𓌫
          𓌬𓌭𓌮𓌯𓌰𓌱𓌲𓌳
  𓌴𓌵𓌶𓌷𓌸𓌹𓌺𓌻𓌼𓌽𓌾𓌿𓍀𓍁𓍂𓍃𓍄𓍅𓍆𓍇𓍈𓍉𓍊𓍋𓍌𓍍𓍎𓍏𓍐𓍑𓍒𓍓𓍔𓍕𓍖𓍗𓍘𓍙𓍚𓍛𓍜𓍝𓍞𓍟𓍠𓍡𓍢𓍣𓍤
          𓍥𓍦𓍧𓍨𓍩𓍪𓍫𓍬𓍭𓍮𓍯𓍰𓍱𓍲𓍳𓍴𓍵𓍶𓍷𓍸𓍹𓍺𓍻𓍼𓍽𓍾𓍿𓎀𓎁𓎂𓎃𓎄𓎅𓎆𓎇𓎈𓎉𓎊𓎋𓎌𓎍𓎎
  𓎏𓎐𓎑𓎒𓎓𓎔𓎕𓎖𓎗𓎘𓎙𓎚𓎛𓎜𓎝𓎞
          𓎟𓎠𓎡𓎢𓎣𓎤𓎥𓎦𓎧𓎨𓎩𓎪𓎫𓎬𓎭𓎮𓎯𓎰𓎱𓎲𓎳𓎴𓎵𓎶𓎷𓎸𓎹𓎺𓎻𓎼𓎽𓎾𓎿𓏀𓏁𓏂𓏃𓏄𓏅𓏆𓏇𓏈𓏉𓏊𓏋𓏌𓏍𓏎𓏏𓏐𓏑
  𓏒𓏓𓏔𓏕𓏖𓏗𓏘𓏙𓏚𓏛𓏜𓏝𓏞𓏟𓏠𓏡𓏢𓏣𓏤𓏥𓏦𓏧𓏨𓏩𓏪𓏫𓏬𓏭𓏮𓏯𓏰𓏱𓏲𓏳𓏴𓏵𓏶𓏷𓏸𓏹𓏺𓏻𓏼𓏽𓏾𓏿𓐀𓐁𓐂𓐃𓐄𓐅𓐆𓐇𓐈𓐉𓐊𓐋𓐌𓐍𓐎
          𓐏𓐐𓐑𓐒𓐓𓐔𓐕𓐖𓐗𓐘𓐙𓐚𓐛𓐜𓐝𓐞𓐟𓐠𓐡𓐢𓐣𓐤𓐥𓐦𓐧𓐨𓐩𓐪𓐫𓐬𓐭𓐮
  2.26 带圈表意文字补充
  🈀🈁🈂🈐🈑🈒🈓🈔🈕🈖🈗🈘🈙🈚🈛🈜🈝🈞🈟🈠🈡🈢🈣🈤🈥🈦🈧🈨
          🈩🈪🈫🈬🈭🈮🈯🈰🈱🈲🈳🈴🈵🈶🈷🈸🈹🈺🉐🉑
          2.25 字母连写形式
  ﬀﬁﬂﬃﬄﬅﬆﬓﬔﬕﬖﬗיִﬞײַﬠﬡﬢﬣﬤﬥﬦﬧﬨ﬩שׁשׂשּׁשּׂאַאָאּבּגּדּהּוּזּטּיּךּכּלּמּנּסּףּפּצּקּרּשּתּוֹבֿכֿפֿﭏ
  2.26 中国-八卦-六十四卦
  八卦是中国古老文化的一种深奥概念，是一套用三组阴阳组成的形而上的哲学符号。八卦生自太极,
  太极生两仪、两仪生四象，即四象生八卦, 八卦交互成六十四卦.

  ☰☱☲☳☴☵☶☷

          ䷀䷁䷂䷃䷄䷅䷆䷇
          ䷈䷉䷊䷋䷌䷍䷎䷏
          ䷐䷑䷒䷓䷔䷕䷖䷗
          ䷘䷙䷚䷛䷜䷝䷞䷟
          ䷠䷡䷢䷣䷤䷥䷦䷧
          ䷨䷩䷪䷫䷬䷭䷮䷯
          ䷰䷱䷲䷳䷴䷵䷶䷷
          ䷸䷹䷺䷻䷼䷽䷾䷿*/